# Bare necessities
git
git-lfs
locales

# Essential utilities
bat
cmake
curl
jq

# Dependencies
autoconf
build-essential
libfuse2
libfreetype6-dev
libfontconfig1-dev
libxcb-xfixes0-dev
libxkbcommon-dev
libssl-dev
libyaml-dev
libreadline6-dev
libgmp-dev
libncurses5-dev
libffi-dev
libgdbm6
libgdbm-dev
libdb-dev
patch
pkg-config
uuid-dev
units
zlib1g-dev

# Useful utilities
htop
btop
shellcheck

# Python
python3
python3-dev
python3-pip
python3-setuptools

# Terminal Multiplexer
tmux

# Docker
docker-ce
docker-ce-cli
containerd.io
docker-buildx-plugin
docker-compose-plugin

# Search tools
ripgrep
fd-find
fzf

# Shells
zsh
